Tekla Open API Reference for Tekla Structures 2025
MeshCatalog Properties
The MeshCatalog type exposes the following members.
Properties
Name | Description
ButtonText
 Gets and sets the text of the button control.
SelectedMeshGrade
 The mesh grade in the control.
SelectedMeshName
 The mesh name in the control.
Top
See Also
Reference
MeshCatalog Class
Tekla.Structures.Dialog.UIControls Namespace